tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf66k40_tdd.h
#define RG0PPS5                       1091
#define RG1PPS                        1092
#define RG1PPS0                       1093
#define RG1PPS1                       1094
#define RG1PPS2                       1095
#define RG1PPS3                       1096
#define RG1PPS4                       1097
#define RG1PPS5                       1098
#define RG2PPS                        1099
#define RG2PPS0                       1100
#define RG2PPS1                       1101
#define RG2PPS2                       1102
#define RG2PPS3                       1103
#define RG2PPS4                       1104
#define RG2PPS5                       1105
#define RG3PPS                        1106
#define RG3PPS0                       1107
#define RG3PPS1                       1108
#define RG3PPS2                       1109
#define RG3PPS3                       1110
#define RG3PPS4                       1111
#define RG3PPS5                       1112
#define RG4PPS                        1113
#define RG4PPS0                       1114
#define RG4PPS1                       1115
#define RG4PPS2                       1116
#define RG4PPS3                       1117
#define RG4PPS4                       1118
#define RG4PPS5                       1119
#define RG6PPS                        1120
#define RG6PPS0                       1121
#define RG6PPS1                       1122
#define RG6PPS2                       1123
#define RG6PPS3                       1124
#define RG6PPS4                       1125
#define RG6PPS5                       1126
#define RG7PPS                        1127
#define RG7PPS0                       1128
#define RG7PPS1                       1129
#define RG7PPS2                       1130
#define RG7PPS3                       1131
#define RG7PPS4                       1132
#define RG7PPS5                       1133
#define RH0PPS                        1134
#define RH0PPS0                       1135
#define RH0PPS1                       1136
#define RH0PPS2                       1137
#define RH0PPS3                       1138
#define RH0PPS4                       1139
#define RH0PPS5                       1140
#define RH1PPS                        1141
#define RH1PPS0                       1142
#define RH1PPS1                       1143
#define RH1PPS2                       1144
#define RH1PPS3                       1145
#define RH1PPS4                       1146
#define RH1PPS5                       1147
#define RH2PPS                        1148
#define RH2PPS0                       1149
#define RH2PPS1                       1150
#define RH2PPS2                       1151
#define RH2PPS3                       1152
#define RH2PPS4                       1153
#define RH2PPS5                       1154
#define RH3PPS                        1155
#define RH3PPS0                       1156
#define RH3PPS1                       1157
#define RH3PPS2                       1158
#define RH3PPS3                       1159
#define RH3PPS4                       1160
#define RH3PPS5                       1161
#define INLVLA                        1162
#define INLVLA0                       1163
#define INLVLA1                       1164
#define INLVLA2                       1165
#define INLVLA3                       1166
#define INLVLA4                       1167
#define INLVLA5                       1168
#define INLVLA6                       1169
#define INLVLA7                       1170
#define SLRCONA                       1171
#define SLRA0                         1172
#define SLRA1                         1173
#define SLRA2                         1174
#define SLRA3                         1175
#define SLRA4                         1176
#define SLRA5                         1177
#define SLRA6                         1178
#define SLRA7                         1179
#define ODCONA                        1180
#define ODCA0                         1181
#define ODCA1                         1182
#define ODCA2                         1183
#define ODCA3                         1184
#define ODCA4                         1185
#define ODCA5                         1186
#define ODCA6                         1187
#define ODCA7                         1188
#define WPUA                          1189
#define WPUA0                         1190
#define WPUA1                         1191
#define WPUA2                         1192
#define WPUA3                         1193
#define WPUA4                         1194
#define WPUA5                         1195
#define WPUA6                         1196
#define WPUA7                         1197
#define ANSELA                        1198
#define ANSELA0                       1199
#define ANSELA1                       1200
#define ANSELA2                       1201
#define ANSELA3                       1202
#define ANSELA4                       1203
#define ANSELA5                       1204
#define ANSELA6                       1205
#define ANSELA7                       1206
#define IOCBF                         1207
#define IOCBF0                        1208
#define IOCBF1                        1209
#define IOCBF2                        1210
#define IOCBF3                        1211
#define IOCBF4                        1212
#define IOCBF5                        1213
#define IOCBF6                        1214
#define IOCBF7                        1215
#define IOCBN                         1216
#define IOCBN0                        1217
#define IOCBN1                        1218
#define IOCBN2                        1219
#define IOCBN3                        1220
#define IOCBN4                        1221
#define IOCBN5                        1222
#define IOCBN6                        1223
#define IOCBN7                        1224
#define IOCBP                         1225
#define IOCBP0                        1226
#define IOCBP1                        1227
#define IOCBP2                        1228
#define IOCBP3                        1229
#define IOCBP4                        1230
#define IOCBP5                        1231
#define IOCBP6                        1232
#define IOCBP7                        1233
#define INLVLB                        1234
#define INLVLB0                       1235
#define INLVLB1                       1236
#define INLVLB2                       1237
#define INLVLB3                       1238
#define INLVLB4                       1239
#define INLVLB5                       1240
#define INLVLB6                       1241
#define INLVLB7                       1242
#define SLRCONB                       1243
#define SLRB0                         1244
#define SLRB1                         1245
#define SLRB2                         1246
#define SLRB3                         1247
#define SLRB4                         1248
#define SLRB5                         1249
#define SLRB6                         1250
#define SLRB7                         1251
#define ODCONB                        1252
#define ODCB0                         1253
#define ODCB1                         1254
#define ODCB2                         1255
#define ODCB3                         1256
#define ODCB4                         1257
#define ODCB5                         1258
#define ODCB6                         1259
#define ODCB7                         1260
#define WPUB                          1261
#define WPUB0                         1262
#define WPUB1                         1263
#define WPUB2                         1264
#define WPUB3                         1265
#define WPUB4                         1266
#define WPUB5                         1267
#define WPUB6                         1268
#define WPUB7                         1269
#define ANSELB                        1270
#define ANSELB0                       1271
#define ANSELB1                       1272
#define ANSELB2                       1273
#define ANSELB3                       1274
#define ANSELB4                       1275
#define ANSELB5                       1276
#define ANSELB6                       1277
#define ANSELB7                       1278
#define IOCCF                         1279
#define IOCCF0                        1280
#define IOCCF1                        1281
#define IOCCF2                        1282
#define IOCCF3                        1283
#define IOCCF4                        1284
#define IOCCF5                        1285
#define IOCCF6                        1286
#define IOCCF7                        1287
#define IOCCN                         1288
#define IOCCN0                        1289
#define IOCCN1                        1290
#define IOCCN2                        1291
#define IOCCN3                        1292
#define IOCCN4                        1293
#define IOCCN5                        1294
#define IOCCN6                        1295
#define IOCCN7                        1296
#define IOCCP                         1297
#define IOCCP0                        1298
#define IOCCP1                        1299
#define IOCCP2                        1300
#define IOCCP3                        1301
#define IOCCP4                        1302
#define IOCCP5                        1303
#define IOCCP6                        1304
#define IOCCP7                        1305
#define INLVLC                        1306
#define INLVLC0                       1307
#define INLVLC1                       1308
#define INLVLC2                       1309
#define INLVLC3                       1310
#define INLVLC4                       1311
#define INLVLC5                       1312
#define INLVLC6                       1313
#define INLVLC7                       1314
#define SLRCONC                       1315
#define SLRC0                         1316
#define SLRC1                         1317
#define SLRC2                         1318
#define SLRC3                         1319
#define SLRC4                         1320
#define SLRC5                         1321
#define SLRC6                         1322
#define SLRC7                         1323
#define ODCONC                        1324
#define ODCC0                         1325
#define ODCC1                         1326
#define ODCC2                         1327
#define ODCC3                         1328
#define ODCC4                         1329
#define ODCC5                         1330
#define ODCC6                         1331
#define ODCC7                         1332
#define WPUC                          1333
#define WPUC0                         1334
#define WPUC1                         1335
#define WPUC2                         1336
#define WPUC3                         1337
#define WPUC4                         1338
#define WPUC5                         1339
#define WPUC6                         1340
#define WPUC7                         1341
#define INLVLD                        1342
#define INLVLD0                       1343
#define INLVLD1                       1344
#define INLVLD2                       1345
#define INLVLD3                       1346
#define INLVLD4                       1347
#define INLVLD5                       1348
#define INLVLD6                       1349
#define INLVLD7                       1350
#define SLRCOND                       1351
#define SLRD0                         1352
#define SLRD1                         1353
#define SLRD2                         1354
#define SLRD3                         1355
#define SLRD4                         1356
#define SLRD5                         1357
#define SLRD6                         1358
#define SLRD7                         1359
#define ODCOND                        1360
#define ODCD0                         1361
#define ODCD1                         1362
#define ODCD2                         1363
#define ODCD3                         1364
#define ODCD4                         1365
#define ODCD5                         1366
#define ODCD6                         1367
#define ODCD7                         1368
#define WPUD                          1369
#define WPUD0                         1370
#define WPUD1                         1371
#define WPUD2                         1372
#define WPUD3                         1373
#define WPUD4                         1374
#define WPUD5                         1375
#define WPUD6                         1376
#define WPUD7                         1377
#define ANSELD                        1378
#define ANSELD0                       1379
#define ANSELD1                       1380
#define ANSELD2                       1381
#define ANSELD3                       1382
#define ANSELD4                       1383
#define ANSELD5                       1384
#define ANSELD6                       1385
#define ANSELD7                       1386
#define IOCEF                         1387
#define IOCEF0                        1388
#define IOCEF1                        1389
#define IOCEF2                        1390
#define IOCEF3                        1391
#define IOCEF4                        1392
#define IOCEF5                        1393
#define IOCEF6                        1394
#define IOCEF7                        1395
#define IOCEN                         1396
#define IOCEN0                        1397
#define IOCEN1                        1398
#define IOCEN2                        1399
#define IOCEN3                        1400
#define IOCEN4                        1401
#define IOCEN5                        1402
#define IOCEN6                        1403
#define IOCEN7                        1404
#define IOCEP                         1405
#define IOCEP0                        1406
#define IOCEP1                        1407
#define IOCEP2                        1408
#define IOCEP3                        1409
#define IOCEP4                        1410
#define IOCEP5                        1411
#define IOCEP6                        1412
#define IOCEP7                        1413
#define INLVLE                        1414
#define INLVLE0                       1415
#define INLVLE1                       1416
#define INLVLE2                       1417
#define INLVLE3                       1418
#define INLVLE4                       1419
#define INLVLE5                       1420
#define INLVLE6                       1421
#define INLVLE7                       1422
#define SLRCONE                       1423
#define SLRE0                         1424
#define SLRE1                         1425
#define SLRE2                         1426
#define SLRE3                         1427
#define SLRE4                         1428
#define SLRE5                         1429
#define SLRE6                         1430
#define SLRE7                         1431
#define ODCONE                        1432
#define ODCE0                         1433
#define ODCE1                         1434
#define ODCE2                         1435
#define ODCE3                         1436
#define ODCE4                         1437
#define ODCE5                         1438
#define ODCE6                         1439
#define ODCE7                         1440
#define WPUE                          1441
#define WPUE0                         1442
#define WPUE1                         1443
#define WPUE2                         1444
#define WPUE3                         1445
#define WPUE4                         1446
#define WPUE5                         1447
#define WPUE6                         1448
#define WPUE7                         1449
#define ANSELE                        1450
#define ANSELE0                       1451
#define ANSELE1                       1452
#define ANSELE2                       1453
#define ANSELE3                       1454
#define ANSELE4                       1455
#define ANSELE5                       1456
#define ANSELE6                       1457
#define ANSELE7                       1458
#define INLVLF                        1459
#define INLVLF0                       1460
#define INLVLF1                       1461
#define INLVLF2                       1462
#define INLVLF3                       1463
#define INLVLF4                       1464
#define INLVLF5                       1465
#define INLVLF6                       1466
#define INLVLF7                       1467
#define SLRCONF                       1468
#define SLRF0                         1469
#define SLRF1                         1470
#define SLRF2                         1471
#define SLRF3                         1472
#define SLRF4                         1473
#define SLRF5                         1474
#define SLRF6                         1475
#define SLRF7                         1476
#define ODCONF                        1477
#define ODCF0                         1478
#define ODCF1                         1479
#define ODCF2                         1480
#define ODCF3                         1481
#define ODCF4                         1482
#define ODCF5                         1483
#define ODCF6                         1484
#define ODCF7                         1485
#define WPUF                          1486
#define WPUF0                         1487
#define WPUF1                         1488
#define WPUF2                         1489
#define WPUF3                         1490
#define WPUF4                         1491
#define WPUF5                         1492
#define WPUF6                         1493
#define WPUF7                         1494
#define ANSELF                        1495
#define ANSELF0                       1496
#define ANSELF1                       1497
#define ANSELF2                       1498
#define ANSELF3                       1499
#define ANSELF4                       1500
#define ANSELF5                       1501
#define ANSELF6                       1502
#define ANSELF7                       1503
#define IOCGF                         1504
#define IOCGF0                        1505
#define IOCGF1                        1506
#define IOCGF2                        1507
#define IOCGF3                        1508
#define IOCGF4                        1509
#define IOCGF5                        1510
#define IOCGF6                        1511
#define IOCGF7                        1512
#define IOCGN                         1513
#define IOCGN0                        1514
#define IOCGN1                        1515
#define IOCGN2                        1516
#define IOCGN3                        1517
#define IOCGN4                        1518
#define IOCGN5                        1519
#define IOCGN6                        1520
#define IOCGN7                        1521
#define IOCGP                         1522
#define IOCGP0                        1523
#define IOCGP1                        1524
#define IOCGP2                        1525
#define IOCGP3                        1526
#define IOCGP4                        1527
#define IOCGP5                        1528
#define IOCGP6                        1529
#define IOCGP7                        1530
#define INLVLG                        1531
#define INLVLG0                       1532
#define INLVLG1                       1533
#define INLVLG2                       1534
#define INLVLG3                       1535
#define INLVLG4                       1536
#define INLVLG5                       1537
#define INLVLG6                       1538
#define INLVLG7                       1539
#define SLRCONG                       1540
#define SLRG0                         1541
#define SLRG1                         1542
#define SLRG2                         1543
#define SLRG3                         1544
#define SLRG4                         1545
#define SLRG5                         1546
#define SLRG6                         1547
#define SLRG7                         1548
#define ODCONG                        1549
#define ODCG0                         1550
#define ODCG1                         1551
#define ODCG2                         1552
#define ODCG3                         1553
#define ODCG4                         1554
#define ODCG5                         1555
#define ODCG6                         1556
#define ODCG7                         1557
#define WPUG                          1558
#define WPUG0                         1559
#define WPUG1                         1560
#define WPUG2                         1561
#define WPUG3                         1562
#define WPUG4                         1563
#define WPUG5                         1564
#define WPUG6                         1565
#define WPUG7                         1566
#define ANSELG                        1567
#define ANSELG0                       1568
#define ANSELG1                       1569
#define ANSELG2                       1570
#define ANSELG3                       1571
#define ANSELG4                       1572
#define ANSELG5                       1573
#define ANSELG6                       1574
#define ANSELG7                       1575
#define INLVLH                        1576
#define INLVLH0                       1577
#define INLVLH1                       1578
#define INLVLH2                       1579
#define INLVLH3                       1580
#define INLVLH4                       1581
#define INLVLH5                       1582
#define INLVLH6                       1583
#define INLVLH7                       1584
#define SLRCONH                       1585
#define SLRH0                         1586
#define SLRH1                         1587
#define SLRH2                         1588
#define SLRH3                         1589
#define SLRH4                         1590
#define SLRH5                         1591
#define SLRH6                         1592
#define SLRH7                         1593
#define ODCONH                        1594
#define ODCH0                         1595
#define ODCH1                         1596
#define ODCH2                         1597
#define ODCH3                         1598
#define ODCH4                         1599
#define ODCH5                         1600
#define ODCH6                         1601
#define ODCH7                         1602
#define WPUH                          1603
#define WPUH0                         1604
#define WPUH1                         1605
#define WPUH2                         1606
#define WPUH3                         1607
#define WPUH4                         1608
#define WPUH5                         1609
#define WPUH6                         1610
#define WPUH7                         1611
#define HLVDCON0                      1612
#define INTL                          1613
#define HLVDINTL                      1614
#define INTH                          1615
#define HLVDINTH                      1616
#define RDY                           1617
#define HLVDRDY                       1618
#define HLVDCON0_OUT                  1619
#define HLVDOUT                       1620
#define HLVDEN                        1621
#define HLVDCON0_EN                   1622
#define HLVDCON1                      1623
#define HLVDSEL0                      1624
#define SEL                           1625
#define SEL0                          1626
#define HLVDSEL1                      1627
#define SEL1                          1628
#define HLVDSEL2                      1629
#define SEL2                          1630
#define HLVDSEL3                      1631
#define SEL3                          1632
#define FVRCON                        1633
#define ADFVR0                        1634
#define ADFVR                         1635
#define ADFVR1                        1636
#define CDAFVR                        1637
#define CDAFVR0                       1638
#define CDAFVR1                       1639
#define TSRNG                         1640
#define TSEN                          1641
#define FVRRDY                        1642
#define FVREN                         1643
#define ZCDCON                        1644
#define ZCDINTN                       1645
#define ZCDINTP                       1646
#define ZCDPOL                        1647
#define ZCDOUT                        1648
