tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf66k40_tdd.h
#define ZCDSEN                        1649
#define DAC1CON0                      1650
#define NSS                           1651
#define DAC1NSS                       1652
#define DAC1PSS0                      1653
#define PSS                           1654
#define PSS0                          1655
#define PSS1                          1656
#define DAC1PSS1                      1657
#define OE2                           1658
#define DAC1OE2                       1659
#define OE1                           1660
#define DAC1OE1                       1661
#define DAC1CON0_EN                   1662
#define DAC1EN                        1663
#define DAC1CON1                      1664
#define DAC1R                         1665
#define DAC1R0                        1666
#define DAC1R1                        1667
#define DAC1R2                        1668
#define DAC1R3                        1669
#define DAC1R4                        1670
#define CM3CON0                       1671
#define C3SYNC                        1672
#define CM3CON0_SYNC                  1673
#define CM3CON0_HYS                   1674
#define C3HYS                         1675
#define CM3CON0_POL                   1676
#define C3POL                         1677
#define C3OUT                         1678
#define CM3CON0_OUT                   1679
#define CM3CON0_EN                    1680
#define C3EN                          1681
#define CM3CON1                       1682
#define CM3CON1_INTN                  1683
#define C3INTN                        1684
#define CM3CON1_INTP                  1685
#define C3INTP                        1686
#define CM3NCH                        1687
#define CM3NCH_NCH                    1688
#define C3NCH0                        1689
#define CM3NCH_NCH0                   1690
#define C3NCH1                        1691
#define CM3NCH_NCH1                   1692
#define C3NCH2                        1693
#define CM3NCH_NCH2                   1694
#define CM3PCH                        1695
#define CM3PCH_PCH                    1696
#define CM3PCH_PCH0                   1697
#define C3PCH0                        1698
#define CM3PCH_PCH1                   1699
#define C3PCH1                        1700
#define CM3PCH_PCH2                   1701
#define C3PCH2                        1702
#define CM2CON0                       1703
#define CM2CON0_SYNC                  1704
#define C2SYNC                        1705
#define C2HYS                         1706
#define CM2CON0_HYS                   1707
#define C2POL                         1708
#define CM2CON0_POL                   1709
#define CM2CON0_OUT                   1710
#define C2OUT                         1711
#define C2EN                          1712
#define CM2CON0_EN                    1713
#define CM2CON1                       1714
#define C2INTN                        1715
#define CM2CON1_INTN                  1716
#define CM2CON1_INTP                  1717
#define C2INTP                        1718
#define CM2NCH                        1719
#define C2NCH0                        1720
#define CM2NCH_NCH0                   1721
#define CM2NCH_NCH                    1722
#define C2NCH1                        1723
#define CM2NCH_NCH1                   1724
#define C2NCH2                        1725
#define CM2NCH_NCH2                   1726
#define CM2PCH                        1727
#define CM2PCH_PCH                    1728
#define C2PCH0                        1729
#define CM2PCH_PCH0                   1730
#define C2PCH1                        1731
#define CM2PCH_PCH1                   1732
#define C2PCH2                        1733
#define CM2PCH_PCH2                   1734
#define CM1CON0                       1735
#define CM1CON0_SYNC                  1736
#define C1SYNC                        1737
#define CM1CON0_HYS                   1738
#define C1HYS                         1739
#define CM1CON0_POL                   1740
#define C1POL                         1741
#define C1OUT                         1742
#define CM1CON0_OUT                   1743
#define CM1CON0_EN                    1744
#define C1EN                          1745
#define CM1CON1                       1746
#define C1INTN                        1747
#define CM1CON1_INTN                  1748
#define CM1CON1_INTP                  1749
#define C1INTP                        1750
#define CM1NCH                        1751
#define C1NCH0                        1752
#define CM1NCH_NCH0                   1753
#define CM1NCH_NCH                    1754
#define C1NCH1                        1755
#define CM1NCH_NCH1                   1756
#define C1NCH2                        1757
#define CM1NCH_NCH2                   1758
#define CM1PCH                        1759
#define CM1PCH_PCH0                   1760
#define C1PCH0                        1761
#define CM1PCH_PCH                    1762
#define CM1PCH_PCH1                   1763
#define C1PCH1                        1764
#define CM1PCH_PCH2                   1765
#define C1PCH2                        1766
#define CMOUT                         1767
#define MC1OUT                        1768
#define MC2OUT                        1769
#define MC3OUT                        1770
#define SSP2BUF                       1771
#define SSP2BUF_SSPBUF                1772
#define SSP2ADD                       1773
#define MSK02                         1774
#define SSP2ADD_SSPADD                1775
#define MSK12                         1776
#define MSK22                         1777
#define MSK32                         1778
#define MSK42                         1779
#define MSK52                         1780
#define MSK62                         1781
#define MSK72                         1782
#define SSP2MSK                       1783
#define SSP2MSK_SSPMSK                1784
#define SSP2MSK_MSK0                  1785
#define SSP2MSK_MSK1                  1786
#define SSP2MSK_MSK2                  1787
#define SSP2MSK_MSK3                  1788
#define SSP2MSK_MSK4                  1789
#define SSP2MSK_MSK5                  1790
#define SSP2MSK_MSK6                  1791
#define SSP2MSK_MSK7                  1792
#define SSP2STAT                      1793
#define SSP2STAT_BF                   1794
#define BF2                           1795
#define SSP2STAT_UA                   1796
#define UA2                           1797
#define SSP2STAT_R_W                  1798
#define RW2                           1799
#define SSP2STAT_nWRITE               1800
#define SSP2STAT_nW                   1801
#define READ_WRITE2                   1802
#define nW2                           1803
#define SSP2STAT_I2C_READ             1804
#define I2C_READ2                     1805
#define SSP2STAT_R_NOT_W              1806
#define R_nW2                         1807
#define SSP2STAT_READ_WRITE           1808
#define nWRITE2                       1809
#define R_W2                          1810
#define SSP2STAT_R_nW                 1811
#define SSP2STAT_NOT_WRITE            1812
#define SSP2STAT_S                    1813
#define S2                            1814
#define START2                        1815
#define SSP2STAT_I2C_START            1816
#define I2C_START2                    1817
#define P2                            1818
#define SSP2STAT_I2C_STOP             1819
#define STOP2                         1820
#define SSP2STAT_P                    1821
#define I2C_STOP2                     1822
#define I2C_DAT2                      1823
#define DATA_ADDRESS2                 1824
#define SSP2STAT_D_NOT_A              1825
#define SSP2STAT_I2C_DAT              1826
#define D_A2                          1827
#define SSP2STAT_NOT_ADDRESS          1828
#define SSP2STAT_D_nA                 1829
#define SSP2STAT_DATA_ADDRESS         1830
#define SSP2STAT_nADDRESS             1831
#define nA2                           1832
#define DA2                           1833
#define nADDRESS2                     1834
#define SSP2STAT_nA                   1835
#define SSP2STAT_D_A                  1836
#define D_nA2                         1837
#define SSP2STAT_CKE                  1838
#define CKE2                          1839
#define SSP2STAT_SMP                  1840
#define SMP2                          1841
#define SSP2CON1                      1842
#define SSP2CON1_SSPM                 1843
#define SSP2CON1_SSPM0                1844
#define SSPM02                        1845
#define SSPM12                        1846
#define SSP2CON1_SSPM1                1847
#define SSP2CON1_SSPM2                1848
#define SSPM22                        1849
#define SSPM32                        1850
#define SSP2CON1_SSPM3                1851
#define SSP2CON1_CKP                  1852
#define CKP2                          1853
#define SSPEN2                        1854
#define SSP2CON1_SSPEN                1855
#define SSPOV2                        1856
#define SSP2CON1_SSPOV                1857
#define WCOL2                         1858
#define SSP2CON1_WCOL                 1859
#define SSP2CON2                      1860
#define SEN2                          1861
#define SSP2CON2_SEN                  1862
#define ADMSK12                       1863
#define SSP2CON2_ADMSK                1864
#define SSP2CON2_RSEN                 1865
#define RSEN2                         1866
#define SSP2CON2_ADMSK1               1867
#define ADMSK22                       1868
#define PEN2                          1869
#define SSP2CON2_PEN                  1870
#define SSP2CON2_ADMSK2               1871
#define ADMSK32                       1872
#define SSP2CON2_RCEN                 1873
#define RCEN2                         1874
#define SSP2CON2_ADMSK3               1875
#define ACKEN2                        1876
#define ADMSK42                       1877
#define SSP2CON2_ADMSK4               1878
#define SSP2CON2_ACKEN                1879
#define ACKDT2                        1880
#define ADMSK52                       1881
#define SSP2CON2_ACKDT                1882
#define SSP2CON2_ADMSK5               1883
#define SSP2CON2_ACKSTAT              1884
#define ACKSTAT2                      1885
#define SSP2CON2_GCEN                 1886
#define GCEN2                         1887
#define SSP2CON3                      1888
#define SSP2CON3_DHEN                 1889
#define SSP2CON3_AHEN                 1890
#define SSP2CON3_SBCDE                1891
#define SSP2CON3_SDAHT                1892
#define SSP2CON3_BOEN                 1893
#define SSP2CON3_SCIE                 1894
#define SSP2CON3_PCIE                 1895
#define SSP2CON3_ACKTIM               1896
#define RC5REG                        1897
#define TX5REG                        1898
#define SP5BRGL                       1899
#define SP5BRGH                       1900
#define RC5STA                        1901
#define RC5STA_RX9D                   1902
#define RC5STA_OERR                   1903
#define RC5STA_FERR                   1904
#define RC5STA_ADDEN                  1905
#define RC5STA_CREN                   1906
#define RC5STA_SREN                   1907
#define RC5STA_RX9                    1908
#define RC5STA_SPEN                   1909
#define TX5STA                        1910
#define TX5STA_TX9D                   1911
#define TX5STA_TRMT                   1912
#define TX5STA_BRGH                   1913
#define TX5STA_SENDB                  1914
#define TX5STA_SYNC                   1915
#define TX5STA_TXEN                   1916
#define TX5STA_TX9                    1917
#define TX5STA_CSRC                   1918
#define BAUD5CON                      1919
#define BAUD5CON_ABDEN                1920
#define BAUD5CON_WUE                  1921
#define BAUD5CON_BRG16                1922
#define BAUD5CON_SCKP                 1923
#define BAUD5CON_RCIDL                1924
#define BAUD5CON_ABDOVF               1925
#define RC4REG                        1926
#define TX4REG                        1927
#define SP4BRGL                       1928
#define SP4BRGH                       1929
#define RC4STA                        1930
#define RC4STA_RX9D                   1931
#define RC4STA_OERR                   1932
#define RC4STA_FERR                   1933
#define RC4STA_ADDEN                  1934
#define RC4STA_CREN                   1935
#define RC4STA_SREN                   1936
#define RC4STA_RX9                    1937
#define RC4STA_SPEN                   1938
#define TX4STA                        1939
#define TX4STA_TX9D                   1940
#define TX4STA_TRMT                   1941
#define TX4STA_BRGH                   1942
#define TX4STA_SENDB                  1943
#define TX4STA_SYNC                   1944
#define TX4STA_TXEN                   1945
#define TX4STA_TX9                    1946
#define TX4STA_CSRC                   1947
#define BAUD4CON                      1948
#define BAUD4CON_ABDEN                1949
#define BAUD4CON_WUE                  1950
#define BAUD4CON_BRG16                1951
#define BAUD4CON_SCKP                 1952
#define BAUD4CON_RCIDL                1953
#define BAUD4CON_ABDOVF               1954
#define RC3REG                        1955
#define TX3REG                        1956
#define SP3BRGL                       1957
#define SP3BRGH                       1958
#define RC3STA                        1959
#define RC3STA_RX9D                   1960
#define RC3STA_OERR                   1961
#define RC3STA_FERR                   1962
#define RC3STA_ADDEN                  1963
#define RC3STA_CREN                   1964
#define RC3STA_SREN                   1965
#define RC3STA_RX9                    1966
#define RC3STA_SPEN                   1967
#define TX3STA                        1968
#define TX3STA_TX9D                   1969
#define TX3STA_TRMT                   1970
#define TX3STA_BRGH                   1971
#define TX3STA_SENDB                  1972
#define TX3STA_SYNC                   1973
#define TX3STA_TXEN                   1974
#define TX3STA_TX9                    1975
#define TX3STA_CSRC                   1976
#define BAUD3CON                      1977
#define BAUD3CON_ABDEN                1978
#define BAUD3CON_WUE                  1979
#define BAUD3CON_BRG16                1980
#define BAUD3CON_SCKP                 1981
#define BAUD3CON_RCIDL                1982
#define BAUD3CON_ABDOVF               1983
#define RC2REG                        1984
#define TX2REG                        1985
#define SP2BRGL                       1986
#define SP2BRGH                       1987
#define RC2STA                        1988
#define RC2STA_RX9D                   1989
#define RCD82                         1990
#define RC2STA_OERR                   1991
#define RC2STA_FERR                   1992
#define RC2STA_ADDEN                  1993
#define RC2STA_CREN                   1994
#define RC2STA_SREN                   1995
#define RC92                          1996
#define RC2STA_RX9                    1997
#define RC8_92                        1998
#define RC2STA_SPEN                   1999
#define TX2STA                        2000
#define TX2STA_TX9D                   2001
#define TXD82                         2002
#define TX2STA_TRMT                   2003
#define TX2STA_BRGH                   2004
#define TX2STA_SENDB                  2005
#define TX2STA_SYNC                   2006
#define TX2STA_TXEN                   2007
#define TX8_92                        2008
#define TX2STA_TX9                    2009
#define TX2STA_CSRC                   2010
#define BAUD2CON                      2011
#define BAUD2CON_ABDEN                2012
#define ABDEN2                        2013
#define WUE2                          2014
#define BAUD2CON_WUE                  2015
#define BRG162                        2016
#define BAUD2CON_BRG16                2017
#define SCKP2                         2018
#define BAUD2CON_SCKP                 2019
#define TXCKP2                        2020
#define BAUD2CON_RCIDL                2021
#define RCMT2                         2022
#define RCIDL2                        2023
#define BAUD2CON_ABDOVF               2024
#define ABDOVF2                       2025
#define SMT2TMRL                      2026
#define SMT2TMRL_SMT2TMR              2027
#define SMT2TMR0                      2028
#define SMT2TMR1                      2029
#define SMT2TMR2                      2030
#define SMT2TMR3                      2031
#define SMT2TMR4                      2032
#define SMT2TMR5                      2033
#define SMT2TMR6                      2034
#define SMT2TMR7                      2035
#define SMT2TMRH                      2036
#define SMT2TMR8                      2037
#define SMT2TMRH_SMT2TMR              2038
#define SMT2TMR9                      2039
#define SMT2TMR10                     2040
#define SMT2TMR11                     2041
#define SMT2TMR12                     2042
#define SMT2TMR13                     2043
#define SMT2TMR14                     2044
#define SMT2TMR15                     2045
#define SMT2TMRU                      2046
#define SMT2TMR16                     2047
#define SMT2TMRU_SMT2TMR              2048
#define SMT2TMR17                     2049
#define SMT2TMR18                     2050
#define SMT2TMR19                     2051
#define SMT2TMR20                     2052
#define SMT2TMR21                     2053
#define SMT2TMR22                     2054
#define SMT2TMR23                     2055
#define SMT2CPRL                      2056
#define SMT2CPRL_SMT2CPR              2057
#define SMT2CPR0                      2058
#define SMT2CPR1                      2059
#define SMT2CPR2                      2060
#define SMT2CPR3                      2061
#define SMT2CPR4                      2062
#define SMT2CPR5                      2063
#define SMT2CPR6                      2064
#define SMT2CPR7                      2065
#define SMT2CPRH                      2066
#define SMT2CPR8                      2067
#define SMT2CPRH_SMT2CPR              2068
#define SMT2CPR9                      2069
#define SMT2CPR10                     2070
#define SMT2CPR11                     2071
#define SMT2CPR12                     2072
#define SMT2CPR13                     2073
#define SMT2CPR14                     2074
#define SMT2CPR15                     2075
#define SMT2CPRU                      2076
#define SMT2CPRU_SMT2CPR              2077
#define SMT2CPR16                     2078
#define SMT2CPR17                     2079
#define SMT2CPR18                     2080
#define SMT2CPR19                     2081
#define SMT2CPR20                     2082
#define SMT2CPR21                     2083
#define SMT2CPR22                     2084
#define SMT2CPR23                     2085
#define SMT2CPWL                      2086
#define SMT2CPWL_SMT2CPW              2087
#define SMT2CPW0                      2088
#define SMT2CPW1                      2089
#define SMT2CPW2                      2090
#define SMT2CPW3                      2091
#define SMT2CPW4                      2092
#define SMT2CPW5                      2093
#define SMT2CPW6                      2094
#define SMT2CPW7                      2095
#define SMT2CPWH                      2096
#define SMT2CPWH_SMT2CPW              2097
#define SMT2CPW8                      2098
#define SMT2CPW9                      2099
#define SMT2CPW10                     2100
#define SMT2CPW11                     2101
#define SMT2CPW12                     2102
#define SMT2CPW13                     2103
#define SMT2CPW14                     2104
#define SMT2CPW15                     2105
#define SMT2CPWU                      2106
#define SMT2CPWU_SMT2CPW              2107
#define SMT2CPW16                     2108
#define SMT2CPW17                     2109
#define SMT2CPW18                     2110
#define SMT2CPW19                     2111
#define SMT2CPW20                     2112
#define SMT2CPW21                     2113
#define SMT2CPW22                     2114
#define SMT2CPW23                     2115
#define SMT2PRL                       2116
#define SMT2PRL_SMT2PR                2117
#define SMT2PR0                       2118
#define SMT2PR1                       2119
#define SMT2PR2                       2120
#define SMT2PR3                       2121
#define SMT2PR4                       2122
#define SMT2PR5                       2123
#define SMT2PR6                       2124
#define SMT2PR7                       2125
#define SMT2PRH                       2126
#define SMT2PRH_SMT2PR                2127
#define SMT2PR8                       2128
#define SMT2PR9                       2129
#define SMT2PR10                      2130
#define SMT2PR11                      2131
#define SMT2PR12                      2132
#define SMT2PR13                      2133
#define SMT2PR14                      2134
#define SMT2PR15                      2135
#define SMT2PRU                       2136
#define SMT2PRU_SMT2PR                2137
#define SMT2PR16                      2138
#define SMT2PR17                      2139
#define SMT2PR18                      2140
#define SMT2PR19                      2141
#define SMT2PR20                      2142
#define SMT2PR21                      2143
#define SMT2PR22                      2144
#define SMT2PR23                      2145
#define SMT2CON0                      2146
#define SMT2PS0                       2147
#define SMT2PS                        2148
#define SMT2PS1                       2149
#define SMT2CON0_CPOL                 2150
#define SMT2CON0_SPOL                 2151
#define SMT2CON0_WPOL                 2152
#define SMT2CON0_STP                  2153
#define SMT2CON0_EN                   2154
#define SMT2CON1                      2155
#define SMT2CON1_MODE                 2156
#define SMT2CON1_MODE0                2157
#define SMT2MODE0                     2158
#define SMT2MODE                      2159
#define SMT2CON1_MODE1                2160
#define SMT2MODE1                     2161
#define SMT2CON1_MODE2                2162
#define SMT2MODE2                     2163
#define SMT2CON1_MODE3                2164
#define SMT2MODE3                     2165
#define SMT2REPEAT                    2166
#define SMT2CON1_REPEAT               2167
#define SMT2GO                        2168
#define SMT2STAT                      2169
#define SMT2AS                        2170
#define SMT2STAT_AS                   2171
#define SMT2WS                        2172
#define SMT2STAT_WS                   2173
#define SMT2STAT_TS                   2174
#define SMT2TS                        2175
#define SMT2RESET                     2176
#define SMT2STAT_RST                  2177
#define SMT2CPWUP                     2178
#define SMT2STAT_CPWUP                2179
#define SMT2STAT_CPRUP                2180
#define SMT2CPRUP                     2181
#define SMT2CLK                       2182
#define SMT2CLK_CSEL                  2183
#define SMT2CSEL0                     2184
#define SMT2CLK_CSEL0                 2185
#define SMT2CSEL                      2186
#define SMT2CSEL1                     2187
#define SMT2CLK_CSEL1                 2188
#define SMT2CSEL2                     2189
#define SMT2CLK_CSEL2                 2190
#define SMT2CSEL3                     2191
#define SMT2CLK_CSEL3                 2192
#define SMT2CSEL4                     2193
#define SMT2CLK_CSEL4                 2194
#define SMT2CSEL5                     2195
#define SMT2CLK_CSEL5                 2196
#define SMT2CSEL6                     2197
#define SMT2CLK_CSEL6                 2198
#define SMT2CSEL7                     2199
#define SMT2CLK_CSEL7                 2200
#define SMT2SIG                       2201
#define SMT2SIG_SSEL                  2202
#define SMT2SIG_SSEL0                 2203
#define SMT2SSEL0                     2204
#define SMT2SSEL                      2205
#define SMT2SIG_SSEL1                 2206
