tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf66k40_tdd.h
#define ADUTH4                        3323
#define ADUTH5                        3324
#define ADUTH6                        3325
#define ADUTH7                        3326
#define ADUTH8                        3327
#define ADUTHH                        3328
#define ADUTH9                        3329
#define ADUTH10                       3330
#define ADUTH11                       3331
#define ADUTH12                       3332
#define ADUTH13                       3333
#define ADUTH14                       3334
#define ADUTH15                       3335
#define ADERR0                        3336
#define ADERRL                        3337
#define ADERR1                        3338
#define ADERR2                        3339
#define ADERR3                        3340
#define ADERR4                        3341
#define ADERR5                        3342
#define ADERR6                        3343
#define ADERR7                        3344
#define ADERR8                        3345
#define ADERRH                        3346
#define ADERR9                        3347
#define ADERR10                       3348
#define ADERR11                       3349
#define ADERR12                       3350
#define ADERR13                       3351
#define ADERR14                       3352
#define ADERR15                       3353
#define ADACC0                        3354
#define ADACCL                        3355
#define ADACC1                        3356
#define ADACC2                        3357
#define ADACC3                        3358
#define ADACC4                        3359
#define ADACC5                        3360
#define ADACC6                        3361
#define ADACC7                        3362
#define ADACC8                        3363
#define ADACCH                        3364
#define ADACC9                        3365
#define ADACC10                       3366
#define ADACC11                       3367
#define ADACC12                       3368
#define ADACC13                       3369
#define ADACC14                       3370
#define ADACC15                       3371
#define ADFLTR0                       3372
#define ADFLTRL                       3373
#define ADFLTR1                       3374
#define ADFLTR2                       3375
#define ADFLTR3                       3376
#define ADFLTR4                       3377
#define ADFLTR5                       3378
#define ADFLTR6                       3379
#define ADFLTR7                       3380
#define ADFLTR8                       3381
#define ADFLTRH                       3382
#define ADFLTR9                       3383
#define ADFLTR10                      3384
#define ADFLTR11                      3385
#define ADFLTR12                      3386
#define ADFLTR13                      3387
#define ADFLTR14                      3388
#define ADFLTR15                      3389
#define NVMADRL                       3390
#define ADR0                          3391
#define ADR                           3392
#define NVMADR0                       3393
#define ADR1                          3394
#define NVMADR1                       3395
#define ADR2                          3396
#define NVMADR2                       3397
#define ADR3                          3398
#define NVMADR3                       3399
#define ADR4                          3400
#define NVMADR4                       3401
#define NVMADR5                       3402
#define ADR5                          3403
#define ADR6                          3404
#define NVMADR6                       3405
#define ADR7                          3406
#define NVMADR7                       3407
#define NVMADRH                       3408
#define ADRH                          3409
#define NVMADR8                       3410
#define ADR8                          3411
#define ADR9                          3412
#define NVMADR9                       3413
#define NVMDAT0                       3414
#define NVMDAT                        3415
#define NVMDAT1                       3416
#define NVMDAT2                       3417
#define NVMDAT3                       3418
#define NVMDAT4                       3419
#define NVMDAT5                       3420
#define NVMDAT6                       3421
#define NVMDAT7                       3422
#define NVMCON1                       3423
#define RD                            3424
#define WR                            3425
#define WREN                          3426
#define WRERR                         3427
#define FREE                          3428
#define NVMREG                        3429
#define NVMREG0                       3430
#define NVMREG1                       3431
#define NVMCON2                       3432
#define LATA                          3433
#define LATA0                         3434
#define LA0                           3435
#define LATA1                         3436
#define LA1                           3437
#define LATA2                         3438
#define LA2                           3439
#define LATA3                         3440
#define LA3                           3441
#define LATA4                         3442
#define LA4                           3443
#define LATA5                         3444
#define LA5                           3445
#define LATA6                         3446
#define LA6                           3447
#define LATA7                         3448
#define LA7                           3449
#define LATB                          3450
#define LB0                           3451
#define LATB0                         3452
#define LB1                           3453
#define LATB1                         3454
#define LB2                           3455
#define LATB2                         3456
#define LB3                           3457
#define LATB3                         3458
#define LB4                           3459
#define LATB4                         3460
#define LB5                           3461
#define LATB5                         3462
#define LB6                           3463
#define LATB6                         3464
#define LB7                           3465
#define LATB7                         3466
#define LATC                          3467
#define LATC0                         3468
#define LC0                           3469
#define LATC1                         3470
#define LC1                           3471
#define LATC2                         3472
#define LC2                           3473
#define LATC3                         3474
#define LC3                           3475
#define LATC4                         3476
#define LC4                           3477
#define LATC5                         3478
#define LC5                           3479
#define LATC6                         3480
#define LC6                           3481
#define LATC7                         3482
#define LC7                           3483
#define LATD                          3484
#define LATD0                         3485
#define LD0                           3486
#define LATD1                         3487
#define LD1                           3488
#define LATD2                         3489
#define LD2                           3490
#define LATD3                         3491
#define LD3                           3492
#define LATD4                         3493
#define LD4                           3494
#define LATD5                         3495
#define LD5                           3496
#define LATD6                         3497
#define LD6                           3498
#define LATD7                         3499
#define LD7                           3500
#define LATE                          3501
#define LATE0                         3502
#define LE0                           3503
#define LATE1                         3504
#define LE1                           3505
#define LATE2                         3506
#define LE2                           3507
#define LATE3                         3508
#define LE3                           3509
#define LATE4                         3510
#define LE4                           3511
#define LATE5                         3512
#define LE5                           3513
#define LATE6                         3514
#define LE6                           3515
#define LATE7                         3516
#define LE7                           3517
#define LATF                          3518
#define LATF0                         3519
#define LF0                           3520
#define LATF1                         3521
#define LF1                           3522
#define LF2                           3523
#define LATF2                         3524
#define LF3                           3525
#define LATF3                         3526
#define LF4                           3527
#define LATF4                         3528
#define LF5                           3529
#define LATF5                         3530
#define LF6                           3531
#define LATF6                         3532
#define LF7                           3533
#define LATF7                         3534
#define LATG                          3535
#define LATG0                         3536
#define LG0                           3537
#define LATG1                         3538
#define LG1                           3539
#define LATG2                         3540
#define LG2                           3541
#define LATG3                         3542
#define LG3                           3543
#define LATG4                         3544
#define LG4                           3545
#define LATG6                         3546
#define LATG7                         3547
#define LATH                          3548
#define LH0                           3549
#define LATH0                         3550
#define LH1                           3551
#define LATH1                         3552
#define LH2                           3553
#define LATH2                         3554
#define LH3                           3555
#define LATH3                         3556
#define LH4                           3557
#define LH5                           3558
#define LH6                           3559
#define LH7                           3560
#define TRISA                         3561
#define TRISA0                        3562
#define TRISA_RA0                     3563
#define TRISA1                        3564
#define TRISA_RA1                     3565
#define TRISA2                        3566
#define TRISA_RA2                     3567
#define TRISA3                        3568
#define TRISA_RA3                     3569
#define TRISA_RA4                     3570
#define TRISA4                        3571
#define TRISA_RA5                     3572
#define TRISA5                        3573
#define TRISA_RA6                     3574
#define TRISA6                        3575
#define TRISA_RA7                     3576
#define TRISA7                        3577
#define TRISB                         3578
#define TRISB_RB0                     3579
#define TRISB0                        3580
#define TRISB_RB1                     3581
#define TRISB1                        3582
#define TRISB_RB2                     3583
#define TRISB2                        3584
#define TRISB_RB3                     3585
#define TRISB3                        3586
#define TRISB_RB4                     3587
#define TRISB4                        3588
#define TRISB_RB5                     3589
#define TRISB5                        3590
#define TRISB_RB6                     3591
#define TRISB6                        3592
#define TRISB_RB7                     3593
#define TRISB7                        3594
#define TRISC                         3595
#define TRISC0                        3596
#define TRISC_RC0                     3597
#define TRISC1                        3598
#define TRISC_RC1                     3599
#define TRISC2                        3600
#define TRISC_RC2                     3601
#define TRISC3                        3602
#define TRISC_RC3                     3603
#define TRISC4                        3604
#define TRISC_RC4                     3605
#define TRISC5                        3606
#define TRISC_RC5                     3607
#define TRISC6                        3608
#define TRISC_RC6                     3609
#define TRISC7                        3610
#define TRISC_RC7                     3611
#define TRISD                         3612
#define TRISD_RD0                     3613
#define TRISD0                        3614
#define TRISD_RD1                     3615
#define TRISD1                        3616
#define TRISD_RD2                     3617
#define TRISD2                        3618
#define TRISD_RD3                     3619
#define TRISD3                        3620
#define TRISD_RD4                     3621
#define TRISD4                        3622
#define TRISD_RD5                     3623
#define TRISD5                        3624
#define TRISD_RD6                     3625
#define TRISD6                        3626
#define TRISD_RD7                     3627
#define TRISD7                        3628
#define TRISE                         3629
#define TRISE_RE0                     3630
#define TRISE0                        3631
#define TRISE1                        3632
#define TRISE_RE1                     3633
#define TRISE2                        3634
#define TRISE_RE2                     3635
#define TRISE_RE3                     3636
#define TRISE3                        3637
#define TRISE_RE4                     3638
#define TRISE4                        3639
#define TRISE_RE5                     3640
#define TRISE5                        3641
#define TRISE_RE6                     3642
#define TRISE6                        3643
#define TRISE_RE7                     3644
#define TRISE7                        3645
#define TRISF                         3646
#define TRISF0                        3647
#define TRISF_RF0                     3648
#define TRISF_RF1                     3649
#define TRISF1                        3650
#define TRISF_RF2                     3651
#define TRISF2                        3652
#define TRISF3                        3653
#define TRISF_RF3                     3654
#define TRISF_RF4                     3655
#define TRISF4                        3656
#define TRISF_RF5                     3657
#define TRISF5                        3658
#define TRISF_RF6                     3659
#define TRISF6                        3660
#define TRISF7                        3661
#define TRISF_RF7                     3662
#define TRISG                         3663
#define TRISG0                        3664
#define TRISG_RG0                     3665
#define TRISG1                        3666
#define TRISG_RG1                     3667
#define TRISG2                        3668
#define TRISG_RG2                     3669
#define TRISG3                        3670
#define TRISG_RG3                     3671
#define TRISG4                        3672
#define TRISG_RG4                     3673
#define TRISG_RG6                     3674
#define TRISG6                        3675
#define TRISG7                        3676
#define TRISG_RG7                     3677
#define TRISH                         3678
#define TRISH0                        3679
#define TRISH_RH0                     3680
#define TRISH1                        3681
#define TRISH_RH1                     3682
#define TRISH2                        3683
#define TRISH_RH2                     3684
#define TRISH3                        3685
#define TRISH_RH3                     3686
#define PORTA                         3687
#define ULPWUIN                       3688
#define PORTA_RA0                     3689
#define PORTA_RA1                     3690
#define PORTA_RA2                     3691
#define PORTA_RA3                     3692
#define PORTA_RA4                     3693
#define LVDIN                         3694
#define PORTA_RA5                     3695
#define PORTA_RA6                     3696
#define PORTA_RA7                     3697
#define PORTA_RJPU                    3698
#define PORTB                         3699
#define PORTB_RB0                     3700
#define PORTB_RB1                     3701
#define PORTB_RB2                     3702
#define CCP2_PA2                      3703
#define PORTB_RB3                     3704
#define PORTB_RB4                     3705
#define PORTB_RB5                     3706
#define PORTB_RB6                     3707
#define PORTB_RB7                     3708
#define PORTC                         3709
#define PORTC_RC0                     3710
#define PA2                           3711
#define PORTC_RC1                     3712
#define CCP2                          3713
#define PA1                           3714
#define PORTC_RC2                     3715
#define PORTC_RC3                     3716
#define PORTC_RC4                     3717
#define PORTC_RC5                     3718
#define PORTC_RC6                     3719
#define PORTC_RC7                     3720
#define PORTD                         3721
#define PORTD_RD0                     3722
#define PORTD_RD1                     3723
#define PORTD_RD2                     3724
#define PORTD_RD3                     3725
#define PORTD_RD4                     3726
#define PORTD_RD5                     3727
#define PORTD_RD6                     3728
#define PORTD_RD7                     3729
#define SS2                           3730
#define PORTE                         3731
#define PD2                           3732
#define RDE                           3733
#define PORTE_RE0                     3734
#define WRE                           3735
#define PORTE_RE1                     3736
#define PC2                           3737
#define PORTE_CS                      3738
#define CCP10                         3739
#define PB2                           3740
#define PORTE_RE2                     3741
#define CCP9E                         3742
#define PORTE_RE3                     3743
#define PC3E                          3744
#define PB3E                          3745
#define PORTE_RE4                     3746
#define CCP8E                         3747
#define CCP7E                         3748
#define PORTE_RE5                     3749
#define PC1E                          3750
#define CCP6E                         3751
#define PORTE_RE6                     3752
#define PB1E                          3753
#define CCP2E                         3754
#define PA2E                          3755
#define PORTE_RE7                     3756
#define PORTF                         3757
#define PORTF_RF0                     3758
#define PORTF_RF1                     3759
#define C2OUTF                        3760
#define PORTF_RF2                     3761
#define C1OUTF                        3762
#define PORTF_RF3                     3763
#define PORTF_RF4                     3764
#define PORTF_RF5                     3765
#define PORTF_RF6                     3766
#define PORTF_RF7                     3767
#define PORTG                         3768
#define PORTG_RG0                     3769
#define PORTG_RG1                     3770
#define C3OUTG                        3771
#define PORTG_RG2                     3772
#define PORTG_RG3                     3773
#define PORTG_RG4                     3774
#define RG5                           3775
#define PORTG_RJPU                    3776
#define PORTG_RG6                     3777
#define PORTG_RG7                     3778
#define PORTH                         3779
#define PORTH_RH0                     3780
#define PORTH_RH1                     3781
#define PORTH_RH2                     3782
#define PORTH_RH3                     3783
#define SSP1BUF                       3784
#define SSP1BUF_SSPBUF                3785
#define SSP1ADD                       3786
#define SSP1ADD_SSPADD                3787
#define SSP1ADD_MSK0                  3788
#define MSK01                         3789
#define SSP1ADD_MSK1                  3790
#define MSK11                         3791
#define SSP1ADD_MSK2                  3792
#define MSK21                         3793
#define MSK31                         3794
#define SSP1ADD_MSK3                  3795
#define SSP1ADD_MSK4                  3796
#define MSK41                         3797
#define MSK51                         3798
#define SSP1ADD_MSK5                  3799
#define SSP1ADD_MSK6                  3800
#define MSK61                         3801
#define MSK71                         3802
#define SSP1ADD_MSK7                  3803
#define SSP1MSK                       3804
#define SSP1MSK_MSK0                  3805
#define SSP1MSK_SSPMSK                3806
#define SSP1MSK_MSK1                  3807
#define SSP1MSK_MSK2                  3808
#define SSP1MSK_MSK3                  3809
#define SSP1MSK_MSK4                  3810
#define SSP1MSK_MSK5                  3811
#define SSP1MSK_MSK6                  3812
#define SSP1MSK_MSK7                  3813
#define SSP1STAT                      3814
#define BF1                           3815
#define SSP1STAT_BF                   3816
#define UA1                           3817
#define SSP1STAT_UA                   3818
#define SSP1STAT_R_NOT_W              3819
#define RW1                           3820
#define SSP1STAT_nW                   3821
#define RW                            3822
#define SSP1STAT_READ_WRITE           3823
#define SSP1STAT_nWRITE               3824
#define SSP1STAT_I2C_READ             3825
#define SSP1STAT_R_W                  3826
#define R                             3827
#define SSP1STAT_NOT_WRITE            3828
#define SSP1STAT_R_nW                 3829
#define SSP1STAT_S                    3830
#define START                         3831
#define START1                        3832
#define SSP1STAT_I2C_START            3833
#define STOP                          3834
#define SSP1STAT_P                    3835
#define STOP1                         3836
#define SSP1STAT_I2C_STOP             3837
#define SSP1STAT_D_NOT_A              3838
#define SSP1STAT_D_A                  3839
#define SSP1STAT_D_nA                 3840
#define SSP1STAT_NOT_ADDRESS          3841
#define SSP1STAT_DATA_ADDRESS         3842
#define SSP1STAT_nA                   3843
#define D                             3844
#define DA1                           3845
#define DA                            3846
#define SSP1STAT_nADDRESS             3847
#define SSP1STAT_I2C_DAT              3848
#define SSP1STAT_CKE                  3849
#define CKE1                          3850
#define SSP1STAT_SMP                  3851
#define SMP1                          3852
#define SSP1CON1                      3853
#define SSP1CON1_SSPM0                3854
#define SSPM01                        3855
#define SSP1CON1_SSPM                 3856
#define SSP1CON1_SSPM1                3857
#define SSPM11                        3858
#define SSP1CON1_SSPM2                3859
#define SSPM21                        3860
#define SSPM31                        3861
#define SSP1CON1_SSPM3                3862
#define SSP1CON1_CKP                  3863
#define CKP1                          3864
#define SSPEN1                        3865
#define SSP1CON1_SSPEN                3866
#define SSPOV1                        3867
#define SSP1CON1_SSPOV                3868
#define WCOL1                         3869
#define SSP1CON1_WCOL                 3870
#define SSP1CON2                      3871
#define SEN1                          3872
#define SSP1CON2_SEN                  3873
#define ADMSK11                       3874
#define SSP1CON2_RSEN                 3875
#define RSEN1                         3876
#define SSP1CON2_ADMSK1               3877
#define SSP1CON2_ADMSK                3878
#define SSP1CON2_PEN                  3879
#define ADMSK21                       3880
